app/controllers/redirect_controller.rb

  def redirect
    url = UrlManager.find_by_short_code(params[:short_code])
    if url.blank?
      render status: 400, json: { message: 'url no encontrada' }
    else
      url.update(counter: url.counter += 1)
---
SELECT "url_managers".* FROM "url_managers" WHERE "url_managers"."short_code" = ? LIMIT ?  [["short_code", "HG7IRQ"], ["LIMIT", 1]]
SELECT 1 AS one FROM "url_managers" WHERE "url_managers"."short_code" = ? AND "url_managers"."id" != ? LIMIT ?  [["short_code", "zNhiGA"], ["id", 1], ["LIMIT", 1]]
UPDATE "url_managers" SET "counter" = ?, "updated_at" = ? WHERE "url_managers"."id" = ?  [["counter", 1], ["updated_at", "2022-07-30 18:37:54.916770"], ["id", 1]]