app/controllers/url_shortener_controller.rb

SELECT "url_managers".* FROM "url_managers" WHERE "url_managers"."url" = ? LIMIT ?  [["url", "https://www.google.com"], ["LIMIT", 1]]
UPDATE "url_managers" SET "short_code" = ?, "updated_at" = ? WHERE "url_managers"."id" = ?  [["short_code", "cO52jw"], ["updated_at", "2022-07-30 18:25:26.405915"], ["id", 1]]
---
  def url_shortener
    url = UrlManager.find_or_initialize_by(permited_params)
    url.short_code = short_code
    url.alexa_rank = obtain_rank(url.url)
    if url.save

SELECT "url_managers".* FROM "url_managers" WHERE (url = 'www.google.com' OR url = 'http://''www.google.com' OR url 'https://''www.google.com')
---
  def get_info
    url = UrlManager.exist?(params[:url])
    if url.present?